In [2]:
import pandas as pd

In [10]:
dados = [
    ['Ana', 23, 'São Paulo'],
    ['Bruno', 35, 'Rio de Janeiro'],
    ['Carlos', 45, 'Belo Horizonte']
]

colunas = ['Nome', 'Idade', 'Cidade']

df = pd.DataFrame(dados, columns= colunas)
(df)

     Nome  Idade          Cidade
0     Ana     23       São Paulo
1   Bruno     35  Rio de Janeiro
2  Carlos     45  Belo Horizonte

In [15]:
dicio = {
    'Nome': ['ana', 'bruno'],
    'idade': [15,34],
    'cidade': ['são paulo', 'rio de janeiro']
}

df = pd.DataFrame(dicio)
df

    Nome  idade          cidade
0    ana     15       são paulo
1  bruno     34  rio de janeiro

In [16]:
df = pd.read_csv()

NameError: name 'nomecsv' is not defined